"""
Скрипт для имитации части интервью с техническим заданием.
Демонстрирует работу системы подбора задач и оценки решений.
"""

import sys
import os
from pathlib import Path
from typing import Optional

# Добавляем путь к модулям
sys.path.insert(0, str(Path(__file__).parent.parent))

from inreractor.interactor import Interactor
from task_search.task_searcher import TaskSearcher
from openai import OpenAI
import json
import random
from resum.resum import Resume


def create_tasks(task_searcher: TaskSearcher):
    """Создает 10 задач на разные темы и добавляет их в базу данных."""
    
    tasks = [
        {
            "индекс": 1,
            "условие": "Дан массив целых чисел nums и целое число target.",
            "описание": "Напишите функцию, которая возвращает индексы двух чисел, сумма которых равна target. Можно предположить, что решение существует и оно единственное."
        },
        {
            "индекс": 2,
            "условие": "Дано бинарное дерево.",
            "описание": "Реализуйте алгоритм обхода дерева в глубину (DFS) и верните значения узлов в порядке обхода."
        },
        {
            "индекс": 3,
            "условие": "Дан неориентированный граф в виде списка смежности.",
            "описание": "Напишите функцию для поиска кратчайшего пути между двумя вершинами используя алгоритм поиска в ширину (BFS)."
        },
        {
            "индекс": 4,
            "условие": "Реализуйте структуру данных стек.",
            "описание": "Создайте класс Stack с методами push, pop, peek и isEmpty. Используйте массив для хранения элементов."
        },
        {
            "индекс": 5,
            "условие": "Дан отсортированный массив целых чисел и целевое значение.",
            "описание": "Реализуйте бинарный поиск для нахождения индекса целевого значения. Если значение не найдено, верните -1."
        },
        {
            "индекс": 6,
            "условие": "Дана строка s.",
            "описание": "Напишите функцию, которая проверяет, является ли строка палиндромом. Игнорируйте регистр и небуквенные символы."
        },
        {
            "индекс": 7,
            "условие": "Дан массив целых чисел.",
            "описание": "Реализуйте алгоритм сортировки слиянием (merge sort) для сортировки массива по возрастанию."
        },
        {
            "индекс": 8,
            "условие": "Реализуйте структуру данных хеш-таблица.",
            "описание": "Создайте класс HashTable с методами put, get и remove. Обработайте коллизии методом цепочек."
        },
        {
            "индекс": 9,
            "условие": "Дано число n.",
            "описание": "Напишите функцию для вычисления n-го числа Фибоначчи. Оптимизируйте решение для работы с большими числами."
        },
        {
            "индекс": 10,
            "условие": "Дан массив целых чисел, представляющий высоты столбцов.",
            "описание": "Найдите максимальную площадь прямоугольника, который можно образовать между столбцами. Используйте подход с двумя указателями."
        }
    ]
    
    print("Добавление задач в базу данных...")
    task_searcher.add_tasks_from_json(tasks)
    print(f"Добавлено задач: {task_searcher.get_task_count()}\n")
    
    return tasks


def generate_fake_code_quality_report(attempt: int) -> str:
    """Генерирует фиктивный отчет о качестве кода."""
    
    reports = [
        "Код написан чисто, следует лучшим практикам. Хорошая читаемость и структура.",
        "Код работает корректно, но есть небольшие проблемы с оптимизацией. Можно улучшить производительность.",
        "Решение частично работает, но есть ошибки в обработке граничных случаев.",
        "Код содержит синтаксические ошибки и не компилируется. Требуется исправление.",
        "Решение неполное, реализована только базовая функциональность без обработки исключений.",
        "Отличное решение! Код оптимален, хорошо структурирован и покрывает все случаи.",
        "Код работает, но нарушает принципы SOLID. Требуется рефакторинг.",
        "Решение правильное, но неоптимальное по времени выполнения. Можно улучшить алгоритм."
    ]
    
    # Первая попытка обычно лучше, последующие могут быть хуже
    if attempt == 1:
        return random.choice(reports[:3] + [reports[5]])  # Хорошие или отличные отчеты
    elif attempt == 2:
        return random.choice(reports[1:4] + reports[6:8])  # Средние отчеты
    else:
        return random.choice(reports[2:5])  # Плохие или средние отчеты


def generate_fake_solution_completeness(attempt: int) -> str:
    """Генерирует фиктивный отчет о полноте решения."""
    
    completions = [
        "Полное решение. Все тестовые случаи проходят успешно.",
        "Решение работает для большинства случаев, но не обрабатывает некоторые граничные условия.",
        "Частичное решение. Реализована основная функциональность, но отсутствуют дополнительные требования.",
        "Решение неполное. Реализована только часть функциональности.",
        "Решение не работает. Код не проходит базовые тесты.",
        "Отличное решение! Все требования выполнены, включая обработку крайних случаев.",
        "Решение работает, но не оптимально. Можно улучшить алгоритмическую сложность."
    ]
    
    if attempt == 1:
        return random.choice(completions[2:5])  # Плохие или средние
    elif attempt == 2:
        return random.choice(completions[1:4] + [completions[6]])  # Средние
    else:
        return random.choice(completions[:2] + [completions[5]])  # Хорошие


def generate_improved_code_quality_report() -> str:
    """Возвращает отчет о значительно улучшенном качестве кода."""
    return random.choice([
        "Код переписан аккуратно, соблюдены соглашения и структура стала понятнее.",
        "Рефакторинг удался: код чистый, без дублирования и с понятными именами.",
        "Код стал более устойчивым: добавлены проверки, логика упрощена."
    ])


def generate_improved_solution_completeness() -> str:
    """Возвращает отчет о полностью доработанном решении."""
    return random.choice([
        "Полное решение. Все тестовые случаи, включая граничные, проходят успешно.",
        "Решение покрывает все требования задачи и корректно обрабатывает исключения.",
        "Отличная работа: реализованы все части задачи, учтены крайние случаи и оптимизация."
    ])


def generate_candidate_response_to_hint(hint_question: str, code_quality: str, 
                                       solution_completeness: str) -> str:
    """
    Генерирует ответ кандидата на наводящий вопрос.
    
    Args:
        hint_question: наводящий вопрос
        code_quality: отчет о качестве кода
        solution_completeness: отчет о полноте решения
    
    Returns:
        Ответ кандидата
    """
    
    # Базовые ответы
    base_responses = [
        "Понял, спасибо за подсказку. Я учту это при доработке решения.",
        "Хороший вопрос. Действительно, я не учел этот момент. Исправлю.",
        "Да, вы правы. Я пропустил этот важный аспект. Переделаю с учетом вашего замечания.",
        "Спасибо за направление. Я подумаю над этим и улучшу решение.",
        "Понял проблему. Сейчас исправлю код с учетом вашего вопроса.",
        "Хорошая мысль. Я добавлю обработку этого случая в решение.",
        "Вы правы, я не учел этот момент. Сейчас доработаю алгоритм."
    ]
    
    # Более конкретные ответы в зависимости от типа вопроса
    hint_lower = hint_question.lower()
    
    if "граничн" in hint_lower or "крайн" in hint_lower or "пуст" in hint_lower:
        specific_responses = [
            "Точно, я не обработал граничные случаи. Добавлю проверки на пустые структуры данных.",
            "Хороший момент. Нужно добавить обработку крайних случаев в алгоритм.",
            "Понял, я пропустил проверку на пустые входные данные. Исправлю."
        ]
        return random.choice(specific_responses + base_responses)
    
    if "оптимизац" in hint_lower or "сложность" in hint_lower or "производительность" in hint_lower:
        specific_responses = [
            "Да, вы правы. Мое решение не оптимально. Попробую улучшить алгоритмическую сложность.",
            "Хороший вопрос. Действительно, можно сделать более эффективно. Пересмотрю подход.",
            "Понял, нужно оптимизировать. Попробую найти более быстрый алгоритм."
        ]
        return random.choice(specific_responses + base_responses)
    
    if "ошибк" in hint_lower or "синтаксис" in hint_lower or "логик" in hint_lower:
        specific_responses = [
            "Спасибо, проверю синтаксис и логику алгоритма. Найду и исправлю ошибки.",
            "Понял, нужно внимательнее проверить код. Исправлю найденные проблемы.",
            "Хорошо, пройдусь по коду еще раз и исправлю ошибки."
        ]
        return random.choice(specific_responses + base_responses)
    
    if "метод" in hint_lower or "структур" in hint_lower:
        specific_responses = [
            "Точно, нужно проверить все методы. Убедюсь, что они реализованы корректно.",
            "Понял, проверю реализацию структуры данных. Исправлю недочеты.",
            "Хороший момент. Пересмотрю реализацию методов."
        ]
        return random.choice(specific_responses + base_responses)
    
    return random.choice(base_responses)


def generate_hinting_question(task_description: str, code_quality: str, 
                              solution_completeness: str, attempt: int) -> str:
    """
    Генерирует наводящий вопрос на основе задачи и качества решения.
    
    Args:
        task_description: описание задачи
        code_quality: отчет о качестве кода
        solution_completeness: отчет о полноте решения
        attempt: номер попытки
    
    Returns:
        Наводящий вопрос для кандидата
    """
    
    # Определяем тип проблемы
    has_errors = any(word in code_quality.lower() for word in ["ошибк", "не компилируется", "не работает"])
    incomplete = any(word in solution_completeness.lower() for word in ["неполн", "частичн", "только часть"])
    not_optimal = any(word in code_quality.lower() + solution_completeness.lower() 
                     for word in ["неоптимальн", "можно улучшить", "производительность"])
    edge_cases = any(word in solution_completeness.lower() for word in ["граничн", "крайн"])
    
    # Генерируем вопросы в зависимости от типа задачи и проблемы
    task_lower = task_description.lower()
    
    hints = []
    
    # Вопросы по граничным случаям
    if edge_cases or incomplete:
        if "массив" in task_lower or "список" in task_lower:
            hints.append("Что произойдет, если массив пустой? Как обработать этот случай?")
            hints.append("Рассмотрите случай, когда массив содержит только один элемент.")
        if "дерево" in task_lower or "граф" in task_lower:
            hints.append("Как обработать случай, когда дерево/граф пустое?")
            hints.append("Что произойдет, если в дереве/графе только один узел?")
        if "поиск" in task_lower:
            hints.append("Что произойдет, если искомый элемент отсутствует?")
            hints.append("Как обработать случай, когда элемент находится на границе массива?")
    
    # Вопросы по оптимизации
    if not_optimal:
        if "сортировка" in task_lower or "поиск" in task_lower:
            hints.append("Какова временная сложность вашего решения? Можно ли улучшить?")
            hints.append("Рассмотрите возможность использования более эффективного алгоритма.")
        if "массив" in task_lower:
            hints.append("Можно ли решить задачу за один проход по массиву?")
            hints.append("Подумайте о возможности использования дополнительной структуры данных.")
    
    # Вопросы по ошибкам
    if has_errors:
        hints.append("Проверьте синтаксис кода. Есть ли незакрытые скобки или неправильные операторы?")
        hints.append("Проверьте логику алгоритма. Правильно ли вы обрабатываете все условия?")
        hints.append("Запустите код мысленно на простом примере. Где может быть ошибка?")
    
    # Вопросы по структурам данных
    if "стек" in task_lower or "очередь" in task_lower or "хеш" in task_lower:
        if incomplete:
            hints.append("Все ли методы структуры данных реализованы корректно?")
            hints.append("Проверьте, правильно ли обрабатываются пустые структуры данных.")
    
    # Вопросы по алгоритмам
    if "bfs" in task_lower or "dfs" in task_lower:
        if incomplete or has_errors:
            hints.append("Правильно ли вы отслеживаете посещенные узлы?")
            hints.append("Убедитесь, что алгоритм не зацикливается на циклических графах.")
    
    if "два указателя" in task_lower or "указатель" in task_lower:
        hints.append("Правильно ли вы перемещаете указатели? Когда нужно двигать каждый?")
        hints.append("Проверьте условия остановки цикла с двумя указателями.")
    
    # Общие вопросы, если специфических нет
    if not hints:
        if incomplete:
            hints.append("Какие части задачи еще не реализованы?")
            hints.append("Проверьте, все ли требования из условия выполнены.")
        if has_errors:
            hints.append("Попробуйте разобрать алгоритм пошагово. Где может быть проблема?")
        else:
            hints.append("Подумайте, можно ли улучшить решение?")
            hints.append("Рассмотрите альтернативные подходы к решению.")
    
    # Выбираем вопрос в зависимости от попытки
    if attempt == 1:
        # Первая попытка - более общие вопросы
        return random.choice([h for h in hints if "подумайте" in h.lower() or "рассмотрите" in h.lower()] or hints)
    elif attempt == 2:
        # Вторая попытка - более конкретные вопросы
        return random.choice([h for h in hints if "?" in h] or hints)
    else:
        # Третья попытка - самые конкретные вопросы
        return random.choice(hints)


def print_theory_progress(interactor: Interactor):
    """Печатает промежуточные итоги по теории."""
    try:
        score = interactor.compute_theory_score()
    except Exception:
        print("Не удалось посчитать прогресс по теории.")
        return

    print("\n--- Промежуточный итог по теории ---")
    print(f"Всего вопросов: {score.get('questions_total', 0)}")
    print(f"Отвечено: {score.get('answered', 0)}")
    print(f"Набрано баллов: {score.get('score', 0)} из {score.get('max_score', 0)}")
    print(f"Процент: {round(score.get('ratio', 0) * 100, 1)}%\n")


def print_practice_progress(interactor: Interactor):
    """Печатает промежуточные итоги по практическим задачам."""
    practice_tasks = [
        item for item in interactor.chat_history
        if item.get("type") == "practice_task"
    ]

    if not practice_tasks:
        print("Практические задачи еще не выполнялись.")
        return

    total_attempts = len(practice_tasks)
    unique_tasks = len(set(item.get("task_index") for item in practice_tasks))

    verdicts = {"mastered": 0, "partially_mastered": 0, "not_mastered": 0, "continue": 0}
    for item in practice_tasks:
        verdict = item.get("verdict", "continue")
        if verdict not in verdicts:
            verdicts[verdict] = 0
        verdicts[verdict] += 1

    print("\n--- Промежуточный итог по практике ---")
    print(f"Рассмотрено задач: {unique_tasks}")
    print(f"Попыток всего: {total_attempts}")
    print("Вердикты:")
    for verdict, count in verdicts.items():
        if count:
            print(f"  {verdict}: {count}")
    print()


def simulate_interview():
    """Имитирует часть интервью с техническим заданием."""
    
    print("=" * 80)
    print("ИМИТАЦИЯ ИНТЕРВЬЮ С ТЕХНИЧЕСКИМ ЗАДАНИЕМ")
    print("=" * 80)
    print()
    
    # Создаем клиент OpenAI
    client = OpenAI(
        api_key="sk-EntOXD173KXh0i-jb0esww",
        base_url="https://llm.t1v.scibox.tech/v1"
    )
    
    # Создаем TaskSearcher
    db_file = os.path.join(os.path.dirname(__file__), "task_database.pkl")
    
    if os.path.exists(db_file):
        print(f"Загрузка базы данных из файла {db_file}...")
        try:
            task_searcher = TaskSearcher.load_from_file(client, db_file)
            print(f"Загружено задач: {task_searcher.get_task_count()}\n")
        except Exception as e:
            print(f"Ошибка при загрузке базы данных: {e}")
            print("Создание новой базы данных...")
            task_searcher = TaskSearcher(client=client, model_name="bge-m3")
            create_tasks(task_searcher)
            print(f"Сохранение базы данных в файл {db_file}...")
            task_searcher.save_to_file(db_file)
            print("База данных сохранена.\n")
    else:
        print("Создание новой базы данных...")
        task_searcher = TaskSearcher(client=client, model_name="bge-m3")
        create_tasks(task_searcher)
        print(f"Сохранение базы данных в файл {db_file}...")
        task_searcher.save_to_file(db_file)
        print("База данных сохранена.\n")
    
    # Создаем Interactor с фиктивным описанием навыков кандидата
    print("Инициализация интервьюера...")
    interactor = Interactor(key="sk-EntOXD173KXh0i-jb0esww", task_searcher=task_searcher)
    
    # Устанавливаем навыки кандидата
    hard_desc = (
        "Я программист с опытом работы с алгоритмами и структурами данных. "
        "Знаю основные алгоритмы сортировки, поиска, работу с графами и деревьями. "
        "Умею реализовывать базовые структуры данных: стеки, очереди, хеш-таблицы. "
        "Имею опыт решения задач на LeetCode среднего уровня сложности."
    )
    
    print("Установка навыков кандидата...")
    result = interactor.put_hard_desc(hard_desc)
    if not result["success"]:
        print(f"Ошибка: {result['message']}")
        return
    
    # Запускаем интервью
    print("Запуск интервью...")
    result = interactor.start_interview()
    if not result["success"]:
        print(f"Ошибка: {result['message']}")
        return
    
    # Проходим теоретическую часть (имитируем быстрые ответы)
    print("\n" + "=" * 80)
    print("ТЕОРЕТИЧЕСКАЯ ЧАСТЬ (имитация)")
    print("=" * 80)
    
    while True:
        question = interactor.get_next_question()
        if question is None:
            break
        
        print(f"\nВопрос: {question}")
        
        # Имитируем ответ кандидата
        fake_answer = (
            "Это хороший вопрос. В общем случае, алгоритм работает следующим образом: "
            "нужно рассмотреть основные принципы и применить их к конкретной ситуации. "
            "Важно учитывать временную и пространственную сложность."
        )
        
        result = interactor.submit_theory_answer(fake_answer)
        if not result["success"]:
            print(f"Ошибка: {result['message']}")
            break

    print_theory_progress(interactor)
    
    # Строим резюме кандидата
    print("\n" + "=" * 80)
    print("ПОСТРОЕНИЕ РЕЗЮМЕ КАНДИДАТА")
    print("=" * 80)
    summary = interactor.build_candidate_summary()
    print(f"\nРезюме: {summary}\n")
    
    # Начинаем практическую часть
    print("=" * 80)
    print("ПРАКТИЧЕСКАЯ ЧАСТЬ")
    print("=" * 80)
    
    result = interactor.start_practice_stage(top_k=5)
    if not result["success"]:
        print(f"Ошибка: {result['message']}")
        return
    
    print(f"Подобрано задач: {result['tasks_count']}\n")
    
    # Проходим по задачам
    task_num = 0
    while True:
        task = interactor.get_next_task()
        if task is None:
            break
        
        task_num += 1
        pending_hint: Optional[str] = None
        print(f"\n{'=' * 80}")
        print(f"ЗАДАЧА #{task_num} (индекс: {task['task_index']})")
        print(f"{'=' * 80}")
        print(f"Описание:\n{task['description']}\n")
        
        # Имитируем несколько попыток решения
        max_attempts = random.randint(1, 3)
        attempt = 0
        
        while attempt < max_attempts:
            attempt += 1
            print(f"\n--- Попытка {attempt} ---")
            
            # Проверяем, есть ли подсказка, которую кандидат собирается применить
            improved_submission = False
            if pending_hint:
                improved_submission = True
                print("Кандидат учитывает предыдущую подсказку и готовит доработанное решение.")
                print(f"Подсказка, которую он применяет: {pending_hint}\n")
                pending_hint = None
            
            # Генерируем отчеты о качестве кода и полноте решения
            if improved_submission:
                print("⚙️  Доработка: кандидат повторно отправляет решение после подсказки.")
                code_quality = generate_improved_code_quality_report()
                solution_completeness = generate_improved_solution_completeness()
            else:
                code_quality = generate_fake_code_quality_report(attempt)
                solution_completeness = generate_fake_solution_completeness(attempt)
            
            print(f"Качество кода: {code_quality}")
            print(f"Полнота решения: {solution_completeness}")
            
            # Опциональное сообщение кандидата
            candidate_message = None
            if attempt > 1:
                candidate_message = f"Я исправил ошибки и улучшил решение. Вот обновленная версия."
            
            # Отправляем решение на оценку
            result = interactor.submit_task_solution(
                code_quality=code_quality,
                solution_completeness=solution_completeness,
                candidate_message=candidate_message
            )
            
            if not result["success"]:
                print(f"Ошибка: {result['message']}")
                break
            
            print(f"\nВердикт: {result['verdict']}")
            print(f"Сообщение: {result['message']}")
            
            # Если задача завершена, переходим к следующей
            if result["task_completed"]:
                print(f"\n✓ Задача завершена с вердиктом: {result['verdict']}")
                break
            
            # Если нужно продолжить диалог - используем наводящий вопрос из результата оценки
            if result["needs_retry"] and attempt < max_attempts:
                print("\n" + "-" * 80)
                print("НАЧАЛО ОБСУЖДЕНИЯ ЗАДАЧИ")
                print("-" * 80)
                
                # Получаем наводящий вопрос из результата (генерируется в interactor)
                hinting_question = result.get("hint")
                
                # Если наводящий вопрос не был сгенерирован, используем fallback
                if not hinting_question:
                    hinting_question = generate_hinting_question(
                        task_description=task['description'],
                        code_quality=code_quality,
                        solution_completeness=solution_completeness,
                        attempt=attempt
                    )
                
                # Начинаем обсуждение: кандидат просит помощи
                candidate_help_request = "Можете дать подсказку, как улучшить решение?"
                print(f"💬 Кандидат: {candidate_help_request}\n")
                
                # Сохраняем запрос кандидата в историю
                interactor.task_dialogue_history.append({
                    "role": "candidate",
                    "content": candidate_help_request
                })
                
                # Интервьюер задает наводящий вопрос (уже сохранен в истории при оценке)
                print(f"👤 Интервьюер: {hinting_question}\n")
                
                # Наводящий вопрос уже сохранен в task_dialogue_history при оценке,
                # но если его там нет, сохраняем вручную
                if not any(entry.get("content") == hinting_question 
                          for entry in interactor.task_dialogue_history 
                          if entry.get("role") == "interviewer"):
                    interactor.task_dialogue_history.append({
                        "role": "interviewer",
                        "content": hinting_question
                    })
                
                # Имитируем несколько раундов обсуждения
                discussion_rounds = random.randint(1, 2)  # 1-2 раунда обсуждения
                
                for round_num in range(discussion_rounds):
                    # Ответ кандидата на наводящий вопрос
                    candidate_response = generate_candidate_response_to_hint(
                        hinting_question, 
                        code_quality, 
                        solution_completeness
                    )
                    
                    print(f"💬 Кандидат: {candidate_response}\n")
                    
                    # Продолжаем диалог через систему - интервьюер отвечает
                    dialogue_result = interactor.continue_task_dialogue(candidate_response)
                    if dialogue_result["success"]:
                        print(f"👤 Интервьюер: {dialogue_result['message']}\n")
                        
                        # Кандидат может задать уточняющий вопрос
                        if round_num < discussion_rounds - 1:
                            follow_up_questions = [
                                "Понял, спасибо. А что насчет производительности?",
                                "Хорошо, учту. Есть ли еще что-то, на что стоит обратить внимание?",
                                "Спасибо за подсказку. Можете уточнить этот момент?",
                                "Понял. А как лучше обработать граничные случаи?"
                            ]
                            follow_up = random.choice(follow_up_questions)
                            print(f"💬 Кандидат: {follow_up}\n")
                            
                            # Интервьюер отвечает на уточняющий вопрос
                            follow_up_result = interactor.continue_task_dialogue(follow_up)
                            if follow_up_result["success"]:
                                print(f"👤 Интервьюер: {follow_up_result['message']}\n")
                    else:
                        break
                
                print("-" * 80)
                print("ОБСУЖДЕНИЕ ЗАВЕРШЕНО. КАНДИДАТ ПРИСТУПАЕТ К ДОРАБОТКЕ РЕШЕНИЯ")
                print("-" * 80 + "\n")
                
                # Гарантируем, что следующая попытка будет учитывать подсказку
                pending_hint = hinting_question
                
                # Если запланированное количество попыток исчерпано, добавляем еще одну
                if attempt >= max_attempts:
                    max_attempts += 1
        
        print(f"\n{'=' * 80}\n")
        print_practice_progress(interactor)
    
    # Выводим итоговую статистику
    print("=" * 80)
    print("ИТОГОВАЯ СТАТИСТИКА")
    print("=" * 80)
    
    practice_tasks = [item for item in interactor.chat_history if item.get("type") == "practice_task"]
    
    print(f"\nВсего задач в практике: {len(set(item['task_index'] for item in practice_tasks))}")
    print(f"Всего попыток решения: {len(practice_tasks)}")
    
    # Собираем последний вердикт для каждой задачи
    task_verdicts = {}
    for item in practice_tasks:
        task_idx = item.get("task_idx")
        verdict = item.get("verdict", "unknown")
        # Обновляем вердикт для задачи (последний будет финальным)
        if verdict in ["mastered", "partially_mastered", "not_mastered"]:
            task_verdicts[task_idx] = verdict
    
    verdicts = {}
    for verdict in task_verdicts.values():
        verdicts[verdict] = verdicts.get(verdict, 0) + 1
    
    print("\nВердикты по задачам:")
    for verdict, count in verdicts.items():
        print(f"  {verdict}: {count}")
    
    if not verdicts:
        print("  (нет финальных вердиктов)")
    
    print("\n" + "=" * 80)
    print("ИНТЕРВЬЮ ЗАВЕРШЕНО")
    print("=" * 80)

    # После практической части формируем полный отчет через Resume
    print("\n" + "=" * 80)
    print("ФОРМИРОВАНИЕ ОБЩЕГО ОТЧЕТА О КАНДИДАТЕ")
    print("=" * 80)

    # Собираем данные для резюме
    resume = Resume(
        api_key="sk-EntOXD173KXh0i-jb0esww",
        base_url="https://llm.t1v.scibox.tech/v1",
        model_name="qwen3-coder-30b-a3b-instruct-fp8",
        candidate_name="Иван Иванов"
    )

    # Добавляем хард-скиллы из первоначального описания
    resume.push_hard(hard_desc)

    # Добавляем теоретическую часть из chat_history
    for entry in interactor.chat_history:
        if entry.get("type") == "theory_qa":
            theory_record = (
                f"Вопрос: {entry.get('question')}\n"
                f"Ответ: {entry.get('answer')}\n"
                f"Вердикт: {entry.get('verdict')}\n"
                f"Комментарий: {entry.get('comment')}"
            )
            resume.push_theoretical(theory_record)

    # Добавляем практическую часть из подробного отчета
    practice_report_text = interactor.get_practice_report_text()
    resume.push_practical(practice_report_text)

    # Формируем итоговый отчет
    full_summary = resume.get_full_summary()
    print(full_summary)


if __name__ == "__main__":
    simulate_interview()

